drop table if exists users;
create table users(
    userId	      varchar(50) primary key,
    userName	    varchar(50) not null,
    kana	        varchar(50) not null,
    zip           char(7) default '',
    address			  varchar(50) default '',
    tel				    varchar(20) default '',
    password      varchar(20)
);

# テーブルusersへデータを入力
insert into users(userId, userName, kana, zip, address, tel, password)
 values('kobe@denshi.net', '神戸　電子', 'コウベ　デンシ', '6500002', '北野町1-1-8',
 '078-242-0014', 'kobedenshi');

 # 新しいデータベースの作成
CREATE DATABASE IF NOT EXISTS seisaku;
# データベースの選択
USE seisaku;
# テーブルhigasinadaku_items0の作成
drop table if exists higasinadaku_items0;
# テーブルhigasinadaku_items0の作成
create table higasinadaku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
    
#テーブルhigasinadaku_items0へデータを入力
INSERT INTO higasinadaku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
VALUES
('東灘小学校', '深江北町', '078-411-0556','○', '○', '○', '○', '×'),
('本庄小学校', '青木', '078-411-0339', '○', '○', '×', '○', '×'),
('本庄中学校', '青木', '078-411-2261', '○', '○', '×', '○', '○'),
('東灘高校', '深江浜町', '078-452-9600', '○', '○', '×', '○', '○'),
('神戸大学海洋政策科学部', '深江南町', '078-431-6200', '○', '○', '×', '○', '×'),
('魚崎小学校', '魚崎中町', '078-411-6196', '○', '○', '○', '○', '○'),
('灘中・高校', '魚崎北町', '078-411-7234', '○', '○', '○', '○', '×'),
('本山第一小学校', '本山北町', '078-411-1974', '○', '○', '○', '○', '○'),
('甲南女子中・高校', '森北町', '078-411-2531', '○', '○', '○', '○', '×'),
('甲南女子大学', '森北町', '078-431-0391', '○', '○', '○', '×', '×'),
('神戸薬科大学', '本山北町', '078-453-0031', '△', '○', '○', '×', '×'),
('本山第二小学校', '西岡本', '078-431-1441', '○', '○', '○', '○', '×'),
('本山中学校', '岡本', '078-411-3742', '○', '○', '○', '○', '×'),
('甲南大学', '岡本', '078-431-4341', '△', '○', '○', '×', '×'),
('本山第三小学校', '本山中町', '078-411-0005', '○', '○', '○', '○', '×'),
('住吉小学校', '住吉東町', '078-851-2887', '○', '〇', '○', '○', '○'),
('住之江公民館', '住吉宮町', '078-822-1300', '○', '〇', '○', '○', '×'),
('住之江公民館別館', '住吉宮町', '078-822-1300', '○', '〇', '○', '○', '×'),
('呉田会館', '住吉南町', '078-841-4060', '○', '○', '○', '○', '×'),
('御影小学校', '御影石町', '078-851-3673', '○', '○', '○', '○', '×'),
('御影高校', '御影石町', '078-841-1501', '○', '○', '○', '○', '○'),
('御影公会堂', '御影石町', '078-841-2281', '○', '○', '○', '○', '○'),
('御影北小学校', '御影山手', '078-851-6809', '○', '○', '○', '○', '×'),
('頌栄短期大学', '御影山手', '078-842-2541', '△', '○', '○', '×', '×'),
('渦が森小学校', '渦森台', '078-851-3185', '○', '○', '○', '○', '○'),
('幼保連携型認定こども園同朋住吉台こども園', '住吉台', '078-846-6011', '○', '○', '○', '○', '○'),
('六甲アイランド小学校', '向洋町中', '078-857-3121', '-', '-', '○', '○', '×'),
('向洋中学校', '向洋町中', '078-857-2481', '-', '-', '○', '○', '○'),
('六甲アイランド高校', '向洋町中', '078-858-4000', '-', '-', '○', '○', '×'),
('福池小学校', '本山南町', '078-452-5595', '○', '○', '○', '○', '×'),
('本山南小学校', '本山南町', '078-452-0071', '○', '○', '○', '○', '×'),
('神戸大学白鴎寮', '本山南町', '078-431-6231', '○', '△', '○', '×', '×'),
('向洋小学校', '向洋町中', '078-857-2450', '-', '-', '○', '○', '○'),
('甲南小学校', '住吉本町', '078-841-1201', '○', '○', '○', '○', '○'),
('神大附属中等教育学校', '住吉山手', '078-811-0232', '○', '○', '○', '○', '○'),
('本山南中学校', '田中町', '078-412-2033', '○', '○', '○', '○', '○'),
('住吉中学校', '住吉山手', '078-851-3752', '○', '○', '○', '○', '×'),
('御影中学校', '御影中町', '078-841-2541', '○', '○', '○', '○', '○'),
('魚崎中学校', '魚崎南町', '078-411-1631', '○', '×', '×', '○', '○'),
('東灘体育館', '魚崎南町', '078-452-9279', '○', '×', '×', '○', '×');

# データベースの選択
USE seisaku;
# テーブル	higasinadaku_items1の作成
drop table if exists items;
# テーブル	higasinadaku_items1の作成
create table higasinadaku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO higasinadaku_items1(name, town, tunami, fire, petto)
VALUES
    ('本庄小学校グラウンド', '青木', '×', '○', '△'),
    ('本庄中学校グラウンド', '青木', '×', '○', '○'),
    ('本庄中央公園', '青木', '×', '○', '○'),
    ('神戸大学テニスコート', '青木', '×', '○', '△'),
    ('本山第二小学校グラウンド', '西岡本', '○', '○', '△'),
    ('本山中学校グラウンド', '岡本', '○', '○', '△'),
    ('住吉小学校グラウンド', '住吉東町', '○', '○', '○'),
    ('住吉宮町公園', '住吉宮町', '○', '○', '○'),
    ('住吉公園', '住吉宮町', '○', '○', '○'),
    ('御影小学校グラウンド', '御影石町', '○', '○', '△'),
    ('御影幼稚園グラウンド', '御影石町', '○', '○', '△'),
    ('渦が森小学校グラウンド', '渦森台', '○', '○', '○'),
    ('福池小学校グラウンド', '本山南町', '○', '○', '△'),
    ('小寄公園', '本山南町', '○', '○', '○'),
    ('神大附属中等教育学校グラウンド', '住吉山手', '○', '○', '○'),
    ('本山南中学校グラウンド', '田中町', '○', '○', '○'),
    ('手水公園', '田中町', '○', '○', '○'),
    ('御影中学校グラウンド', '御影中町', '○', '○', '○'),
    ('御影公園', '御影中町', '○', '○', '○'),
    ('魚崎中学校グラウンド', '魚崎南町', '×', '○', '○'),
    ('瀬戸公園', '魚崎南町', '×', '○', '○'),
    ('森公園', '森南町', '○', '○', '○');

# データベースの選択
USE seisaku;
# テーブルnadaku_items0の作成
drop table if exists nadaku_items0;
# テーブルnadaku_items0の作成
create table nadaku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into nadaku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('鶴甲小学校', '鶴甲', '078-821-0444', '△', '○', '○', '○', '○'),
('神戸大学農学部', '六甲台町', '078-803-5921', '○', '○', '○', '○', '×'),
('神戸大学工学部', '六甲台町', '078-803-6333', '△', '○', '○', '×', '×'),
('神戸大学大学院人間発達環境学研究科', '鶴甲', '078-803-7905', '○', '○', '○', '○', '×'),
('神戸松蔭女子学院大学', '篠原伯母野山町', '078-882-6121', '○', '○', '○', '×', '×'),
('成徳小学校', '備後町', '078-821-1001', '○', '○', '○', '○', '○'),
('高羽小学校', '高羽町', '078-841-0541', '○', '○', '○', '○', '○'),
('親和女子高校・親和中学校', '土山町', '078-854-3800', '△', '○', '○', '×', '×'),
('西郷小学校', '大石東町', '078-861-2888', '○', '○', '○', '○', '○'),
('六甲小学校', '八幡町', '078-881-1071', '○', '○', '○', '○', '○'),
('福住小学校', '福住通', '078-861-2424', '△', '○', '○', '○', '○'),
('神戸高校', '城の下通', '078-861-0434', '○', '○', '○', '○', '×'),
('王子スポーツセンター', '青谷町', '078-802-0223', '○', '○', '○', '○', '×'),
('西灘小学校', '船寺通', '078-861-8851', '○', '○', '○', '○', '○'),
('原田中学校', '船寺通', '078-861-0431', '○', '○', '○', '○', '○'),
('灘の浜小学校', '摩耶海岸通', '078-802-1750', '〇', '〇', '〇', '〇', '○'),
('稗田小学校', '岸地通', '078-871-0721', '○', '○', '○', '○', '○'),
('美野丘小学校', '箕岡通', '078-871-1381', '○', '○', '○', '○', '○'),
('東灘小学校', '深江北町', '078-411-0556', '○', '○', '○', '○', '×');

# テーブルnadaku_items1の作成
drop table if exists nadaku_items1;
# テーブルnadaku_items1の作成
create table nadaku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
insert into nadaku_items1 (name, town, tunami, fire, petto)
values
('神戸大学', '六甲台', '○', '○', '×'),
('成徳小学校グラウンド', '備後町', '○', '○', '○'),
('成徳公園', '備後町', '○', '○', '○'),
('大和公園', '中郷町', '○', '○', '○'),
('六甲風の郷公園', '六甲町', '○', '○', '○'),
('六甲道南公園', '桜口', '○', '○', '○'),
('王子公園', '王子町', '○', '○', '○'),
('西郷川河口公園', '摩耶海岸通', '○', '○', '○'),
('摩耶海岸通公園', '摩耶海岸通', '×', '○', '○');

# データベースの選択
USE seisaku;
# テーブルtyuuouku_items0の作成
drop table if exists tyuuouku_items0;
# テーブルtyuuouku_items0の作成
create table tyuuouku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into tyuuouku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('上筒井小学校', '野崎通', '078-241-1080', '○', '○', '○', '○', '○'),
('筒井台中学校', '野崎通', '078-241-3201', '○', '○', '○', '○', '○'),
('葺合高校', '野崎通', '078-291-0771', '○', '○', '○', '○', '×'),
('宮本小学校', '宮本通', '078-221-1600', '○', '○', '○', '○', '○'),
('科学技術高校', '脇浜町', '078-272-9900', '○', '〇', '○', '○', '○'),
('葺合中学校', '熊内町', '078-241-0444', '×', '○', '○', '○', '○'),
('春日野小学校', '宮本通', '078-231-2461', '○', '〇', '○', '○', '○'),
('なぎさ小学校', '脇浜海岸通', '078-252-5611', '○', '○', '○', '○', '○'),
('渚中学校', '脇浜海岸通', '078-242-4501', '○', '○', '○', '○', '○'),
('雲中小学校', '熊内町', '078-231-3441', '○', '○', '○', '○', '○'),
('布引中学校', '熊内町', '078-241-0010', '×', '○', '○', '○', '○'),
('中央小学校', '神若通', '078-231-2421', '○', '○', '○', '○', '○'),
('コミスタこうべ（生涯学習支援センター）', '吾妻通', '078-251-4731', '○', '○', '○', '○', '○'),
('葺合公民館', '真砂通', '078-232-4026', '○', '○', '○', '○', '×'),
('磯上体育館', '八幡通', '078-251-6622', '○', '○', '○', '○', '×'),
('こうべ市民福祉交流センター', '磯上通', '078-271-5315', '○', '○', '○', '×', '×'),
('こうべ小学校', '中山手通', '078-221-2539', '○', '○', '○', '○', '○'),
('浄福寺', '北野町', '078-221-3052', '○', '○', '○', '×', '×'),
('海外移住と文化の交流センター', '山本通', '078-272-2362', '×', '○', '○', '○', '×');
('神戸生田中学校', '北長狭通', '078-334-1850', '○', '○', '○', '○', '○'),
('山の手小学校', '中山手通', '078-341-8911', '○', '○', '○', '○', '○'),
('中央図書館', '楠町', '078-371-3301', '○', '○', '○', '○', '×'),
('湊翔楠中学校', '楠町', '078-351-2152', '○', '○', '○', '○', '○'),
('中央体育館', '楠町', '078-341-7971', '○', '○', '○', '○', '○'),
('湊小学校', '東川崎町', '078-360-1200', '○', '○', '×', '○', '○'),
('産業振興センター', '東川崎町', '078-360-3214', '○', '○', '△', '×', '×'),
('こうべまちづくり会館', '元町通', '078-361-4523', '○', '○', '×', '○', '×'),
('義務教育学校港島学園', '港島中町', '078-302-1661', '－', '－', '○', '○', '○'),
('神戸国際展示場', '港島中町', '078-302-1020', '－', '－', '○', '○', '×'),
('ワールド記念ホール', '港島中町', '078-302-8781', '－', '－', '○', '○', '×'),
('ポートアイランドスポーツセンター', '港島中町', '078-302-1031', '－', '－', '○', '○', '×'),
('バンドー神戸青少年科学館', '港島中町', '078-302-5177', '－', '－', '○', '○', '×'),
('神戸学院大学', '港島', '078-974-1551', '－', '－', '○', '○', '×'),
('福地小学校', '本山南町', '078-351-2152', '×', '○', '×', '○', '○');

# テーブル	tyuuouku_items1の作成
drop table if exists tyuuouku_items1;
# テーブル	tyuuoku_items1の作成
create table tyuuouku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO tyuuouku_items1(name, town, tunami, fire, petto)
VALUES
('上筒井小学校グラウンド', '野崎通', '○', '○', '○'),
('筒井台中学校グラウンド', '野崎通', '○', '○', '○'),
('葺合高校グラウンド', '野崎通', '○', '○', '×'),
('なぎさ公園', '脇浜海岸通', '×', '○', '○'),
('脇浜海岸通公園', '脇浜海岸通', '×', '○', '○'),
('なぎさ小学校グラウンド', '脇浜海岸通', '○', '○', '○'),
('渚中学校グラウンド', '脇浜海岸通', '○', '○', '○'),
('東遊園地', '加納町', '○', '○', '○'),
('磯上公園', '八幡通', '○', '○', '○'),
('メリケンパーク', '波止場町', '×', '○', '○'),
('大倉山公園', '楠町', '○', '○', '○'),
('湊翔楠中学校グラウンド', '楠町', '○', '○', '○'),
('生田川公園（ＨＡＴゆめ公園）', '脇浜海岸通', '×', '○', '○'),
('神戸震災復興記念公園（みなとのもり公園）', '小野浜町', '×', '○', '○'),
('神戸大学', '六甲台', '○', '○', '×');

# データベースの選択
USE seisaku;
# テーブルhyougoku_items0の作成
drop table if exists hyougoku_items0;
# テーブルhyougoku_items0の作成
create table hyougoku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into hyougoku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('神戸祇園小学校', '下三条町', '078-511-2600', '○', '○', '○', '○', '○'),
('ネイチャー スタジオ（NATURE STUDIO）', '雪御所町', '078-521-2370', '○', '○', '○', '×', '○'),
('建設局中央水環境センター鈴蘭台処理場', '烏原町字譲原', '078-521-0020', '×', '○', '○', '○', '×'),
('友生支援学校', '夢野町', '078-576-6120', '○', '○', '○', '○', '×'),
('夢野中学校', '鵯越町', '078-511-5555', '○', '○', '○', '○', '○'),
('夢野こどもホーム（一階地域交流スペース）', '夢野町', '078-511-3445', '○', '○', '○', '×', '○'),
('夢野の丘小学校', '東山町', '078-521-7340', '○', '○', '○', '○', '○'),
('会下山小学校', '上沢通', '078-577-1501', '○', '○', '○', '○', '○'),
('湊川中学校・楠高校', '松本通', '078-521-4874', '○', '○', '○', '○', '○'),
('神港橘高校', '会下山町', '078-579-2000', '○', '○', '○', '○', '○'),
('兵庫大開小学校', '大開通', '078-575-4773', '○', '○', '○', '○', '○'),
('水木小学校', '水木通', '078-575-8360', '○', '○', '○', '○', '○'),
('兵庫中学校', '永沢町', '078-577-0744', '○', '○', '○', '○', '○'),
('明親小学校', '須佐野通', '078-651-2855', '○', '○', '○', '○', '○'),
('須佐野中学校', '松原通', '078-671-4261', '○', '○', '△', '○', '○'),
('和田岬小学校', '和田宮通', '078-671-1105', '○', '○', '×', '○', '○'),
('兵庫工業高校', '和田宮通', '078-671-1431', '○', '○', '△', '○', '×'),
('浜山小学校', '材木町', '078-651-3890', '○', '○', '○', '○', '○'),
('吉田中学校', '吉田町', '078-681-3545', '○', '○', '×', '○', '○'),
('高齢者ケアセンターひょうご', '里山町 ', '078-612-3335', '○', '○', '○', '×', '×');

# テーブル	hyougoku_items1の作成
drop table if exists hyougoku_items1;
# テーブル	hyugoku_items1の作成
create table hyougoku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO hyougoku_items1(name, town, tunami, fire, petto)
VALUES
('湊川公園', '荒田町', '○', '○', '○'),
('荒田公園', '荒田町', '○', '○', '○'),
('夢野中学校第２グラウンド', '鵯越町', '○', '○', '○'),
('夢野台公園', '滝山町', '○', '○', '○'),
('会下山公園', '会下山町', '○', '○', '○'),
('会下山配水場', '湊川町', '○', '○', '○'),
('キャナルタウン広場（駅前）', '駅南通', '○', '○', '○'),
('兵庫駅南公園', '駅南通', '○', '○', '○'),
('正慶町公園', '駅南通', '○', '○', '○'),
('キャナルタウン広場（西）', '駅南通', '○', '○', '○'),
('御崎公園', '御崎町', '×', '○', '○'),
('菊水公園', '菊水町', '○', '○', '○');

# データベースの選択
USE seisaku;
# テーブルkitaku_items0の作成
drop table if exists kitaku_items0;
# テーブルkitaku_items0の作成
create table kitaku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into kitaku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('鵯台中学校', 'ひよどり台', '078-743-0072', '○', '○', '-', '○', '○'),
('ひよどり台小学校', 'ひよどり台', '078-743-0062', '○', '○', '-', '○', '△'),
('星和台中学校', '星和台', '078-593-8400', '○', '○', '-', '○', '○'),
('星和台小学校', '星和台', '078-593-8200', '○', '○', '-', '○', '○'),
('鈴蘭台中学校', '北五葉', '078-591-4521', '○', '○', '-', '○', '△'),
('北五葉小学校', '北五葉', '078-591-1196', '○', '○', '-', '○', '△'),
('藍那小河地域福祉センター', '山田町藍那字下の町', '078-203-1543', '○', '○', '-', '○', '△'),
('君影小学校', '君影町', '078-592-0059', '○', '○', '-', '○', '○'),
('南五葉小学校', '南五葉', '078-591-1314', '○', '○', '-', '○', '○'),
('鈴蘭台小学校', '鈴蘭台南町', '078-592-8181', '○', '○', '-', '○', '○'),
('小部小学校', '鈴蘭台北町', '078-591-1761', '○', '○', '-', '○', '○'),
('小部中学校', '山田町小部字向井谷', '078-592-1177', '○', '○', '-', '○', '△'),
('小部東小学校', '鈴蘭台北町', '078-592-0086', '○', '○', '-', '○', '△'),
('泉台小学校', '泉台', '078-593-7771', '○', '○', '-', '○', '○'),
('桜の宮小学校', '若葉台', '078-591-1009', '○', '○', '-', '○', '△'),
('桜の宮中学校', '大脇台', '078-593-8001', '○', '○', '-', '○', '△'),
('大原中学校', '大原', '078-581-6661', '○', '○', '-', '○', '○'),
('桂木小学校', '桂木', '078-582-4001', '○', '○', '-', '○', '○'),
('甲緑小学校', '緑町', '078-581-1221', '○', '○', '-', '○', '○'),
('箕谷小学校', '松が枝町', '078-581-8030', '○', '○', '-', '○', '○'),
('広陵小学校', '筑紫が丘', '078-583-0191', '○', '○', '-', '○', '○'),
('広陵中学校', '小倉台', '078-583-1313', '○', '○', '-', '○', '○'),
('筑紫が丘小学校', '筑紫が丘', '078-581-1006', '○', '○', '-', '○', '△'),
('山田中学校', '山田町下谷上字宮ノ前', '078-581-1068', '△', '○', '-', '○', '○'),
('谷上小学校', '山田町下谷上字中上', '078-581-3351', '○', '○', '-', '○', '○'),
('山田小学校', '山田町中字長尾サ', '078-581-0055', '○', '○', '-', '○', '△'),
('花山小学校', '花山東町', '078-583-1120', '○', '○', '-', '○', '○'),
('大池中学校', '西大池', '078-581-8034', '○', '○', '-', '○', '△'),
('大池小学校', '西大池', '078-581-8032', '○', '○', '-', '○', '△'),
('六甲が丘会館', '東大池', '078-981-8806', '○', '○', '-', '○', '△'),
('唐櫃中学校', '唐櫃台', '078-982-6461', '○', '○', '-', '○', '○'),
('唐櫃小学校', '唐櫃台', '078-981-5926', '○', '○', '-', '○', '○'),
('神戸北高校', '唐櫃台', '078-981-0131', '○', '○', '-', '○', '△'),
('有馬小学校', '有馬町', '078-904-0170', '○', '○', '-', '○', '○'),
('五社ふれあい館', '有野町有野', '-', '○', '○', '-', '○', '△'),
('有馬中学校', '有野台', '078-981-5101', '○', '○', '-', '○', '○'),
('ありの台小学校', '有野台', '078-981-5111', '○', '○', '-', '○', '○'),
('藤原台小学校', '藤原台南町', '078-982-5880', '○', '○', '-', '○', '○'),
('有野小学校', '藤原台中町', '078-981-5341', '○', '○', '-', '○', '○'),
('有野中学校', '藤原台中町', '078-982-2700', '○', '○', '-', '○', '○'),
('有野北中学校', '藤原台北町', '078-987-3057', '○', '○', '-', '○', '○'),
('ＪＡ兵庫六甲（神戸北文化センター）', '有野中町', '078-981-6550', '○', '○', '-', '○', '△'),
('西山小学校', '西山', '078-952-1800', '○', '○', '-', '○', '○'),
('西二郎集会所', '有野町有野', '-', '○', '○', '-', '○', '△'),
('道場小学校', '道場町塩田', '078-985-4016', '○', '×', '-', '○', '○'),
('生野自治会館', '道場町生野', '078-985-5322', '○', '×', '-', '○', '△'),
('平田自治会館', '道場町平田', '078-985-5866', '○', '○', '-', '○', '△'),
('生野高原安心コミュニティプラザ', '道場町生野', '-', '○', '○', '-', '○', '△'),
('義務教育学校八多学園', '八多町附物', '078-982-0048', '○', '○', '-', '○', '○'),
('中公民館', '八多町中', '078-951-0303', '○', '○', '-', '○', '△'),
('大沢小・中学校', '大沢町中大沢', '078-954-0310', '○', '○', '-', '○', '○'),
('上大沢ふれあい会館', '大沢町上大沢', '078-954-0633', '○', '○', '-', '○', '△'),
('長尾小学校', '上津台', '078-986-2074', '○', '○', '-', '○', '○'),
('岩谷公会堂', '長尾町上津', '078-986-2510', '○', '○', '-', '○', '△'),
('鹿の子台小学校', '鹿の子台北町', '078-952-1720', '○', '○', '-', '○', '○'),
('北神戸中学校', '鹿の子台北町', '078-951-0821', '○', '○', '-', '○', '△'),
('好徳小学校', '淡河町野瀬', '078-958-0004', '○', '○', '-', '○', '○'),
('淡河中学校', '淡河町行原字中沢', '078-958-0301', '○', '○', '-', '○', '○'),
('淡河小学校', '淡河町萩原', '078-959-0113', '○', '○', '-', '○', '○');

# テーブル	kitaku_items1の作成
drop table if exists kitaku_items1;
# テーブル	kitaku_items1の作成
create table kitaku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO kitaku_items1(name, town, tunami, fire, petto)
VALUES
('鈴蘭公園', '南五葉', '-', '○', '○'),
('南五葉小学校グラウンド', '南五葉', '-', '○', '○'),
('鵯越墓園', '山田町下谷上字中一里山', '-', '○', '○');

# データベースの選択
USE seisaku;
# テーブルnagataku_items0の作成
drop table if exists nagataku_items0;
# テーブルnagataku_items0の作成
create table nagataku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into nagataku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('室内小学校', '前原町', '078-691-0917', '○', '○', '○', '○', '○'),
('長田公民館', '四番町', '078-575-1374', '○', '○', '○', '○', '×'),
('夢野台高校', '房王寺町', '078-691-1546', '○', '○', '○', '○', '○'),
('名倉小学校', '房王寺町', '078-691-6181', '△', '○', '○', '○', '○'),
('丸山中学校', '大丸町', '078-691-0005', '○', '○', '○', '○', '○'),
('雲雀丘中学校', '雲雀ヶ丘', '078-631-8748', '○', '○', '○', '○', '○'),
('丸山ひばり小学校', '西丸山町', '078-691-8552', '○', '○', '○', '○', '○'),
('総合療育センター', '丸山町', '078-646-5291', '○', '○', '○', '○', '×'),
('丸山コミュニティ・センター', '西丸山町', '078-643-3447', '○', '○', '○', '○', '○'),
('宮川小学校', '長田町', '078-631-2721', '○', '○', '○', '○', '○'),
('池田小学校', '池田上町', '078-691-1661', '△', '○', '○', '○', '○'),
('西代中学校', '上池田', '078-691-1521', '×', '○', '○', '○', '○'),
('長田高校', '池田谷町', '078-621-4101', '○', '○', '○', '○', '×'),
('蓮池小学校', '大谷町', '078-691-4215', '○', '○', '○', '○', '○'),
('神戸常盤大学', '大谷町', '078-611-1821', '△', '○', '○', '○', '○'),
('長田小学校', '西山町', '078-631-2731', '○', '○', '○', '○', '○'),
('高取台中学校', '高取山町', '078-611-6325', '△', '○', '○', '○', '○'),
('育英高校', '長尾町', '078-611-6001', '×', '○', '○', '○', '×'),
('五位の池小学校', '五位ノ池町', '078-631-2741', '○', '○', '○', '○', '○'),
('御蔵小学校', '一番町', '078-575-2226', '○', '○', '○', '○', '○'),
('真野小学校', '苅藻通', '078-671-0190', '○', '△', '○', '○', '○'),
('長田中学校', '真野町', '078-671-3757', '○', '○', '○', '○', '○'),
('長田南小学校', '神楽町', '078-691-1702', '○', '○', '○', '○', '○'),
('駒ヶ林中学校', '若松町', '078-611-0082', '○', '○', '○', '○', '○'),
('真陽小学校', '二葉町', '078-611-0456', '○', '△', '○', '○', '○'),
('ふたば学舎', '二葉町', '078-646-8128', '○', '○', '○', '○', '○'),
('駒ケ林小学校', '野田町', '078-731-7061', '○', '○', '○', '○', '○');

# テーブル	nagataku_items1の作成
drop table if exists tarumiku_items1;
# テーブル	nagataku_items1の作成
create table nagataku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO tarumiku_items1(name, town, tunami, fire, petto)
VALUES
('長田南小学校グラウンド', '神楽町', '○', '○', '○'),
('神楽公園', '細田町', '○', '○', '○'),
('新湊川公園', '細田町', '○', '○', '○'),
('蓮池小学校グラウンド', '大谷町', '○', '○', '○'),
('西代蓮池公園', '蓮池町', '○', '○', '○'),
('水笠通公園', '水笠通', '○', '○', '○'),
('若松公園', '若松町', '○', '○', '○'),
('駒ヶ林中学校グラウンド', '若松町', '○', '○', '○'),
('駅前広場', '若松町', '○', '○', '○');

# データベースの選択
USE seisaku;
# テーブルsumaku_items0の作成
drop table if exists sumaku_items0;
# テーブルsumaku_items0の作成
create table sumaku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into sumaku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('若宮小学校', '若宮町', '078-731-0007', '○', '×', '○', '○', '○'),
('鷹取中学校', '青葉町', '078-731-0066', '○', '×', '○', '○', '○'),
('南須磨公民館', '青葉町', '078-735-2770', '○', '×', '○', '○', '×'),
('西須磨小学校', '行幸町', '078-731-0295', '○', '○', '○', '○', '×'),
('須磨一の谷プラザ', '一ノ谷町', '078-731-8353', '△', '○', '○', '○', '○'),
('北須磨小学校', '離宮西町', '078-731-8149', '○', '○', '○', '○', '×'),
('だいち小学校', '大池町', '078-739-1502', '○', '○', '○', '○', '○'),
('太田中学校', '大黒町', '078-732-0854', '○', '○', '○', '○', '○'),
('東須磨小学校', '堀池町', '078-731-0448', '○', '○', '○', '○', '○'),
('須磨体育館', '中島町', '078-734-5588', '○', '○', '○', '○', '×'),
('飛松中学校', '大手町', '078-731-9494', '○', '○', '○', '○', '○'),
('高倉台小学校', '高倉台', '078-734-1766', '○', '○', '○', '○', '○'),
('高倉中学校', '高倉台', '078-733-1140', '○', '○', '○', '○', '○'),
('板宿小学校', '菊池町', '078-732-4055', '○', '○', '○', '○', '○'),
('多井畑小学校', '友が丘', '078-792-0450', '△', '○', '○', '○', '×'),
('友が丘中学校', '友が丘', '078-792-5567', '○', '○', '○', '○', '○'),
('多井畑自治会館', '多井畑字東所', '078-741-5020', '○', '○', '○', '○', '×'),
('横尾小学校', '横尾', '078-743-4511', '○', '○', '○', '○', '○'),
('横尾中学校', '横尾', '078-743-7322', '△', '○', '○', '○', '×'),
('妙法寺小学校', '妙法寺', '078-741-2559', '△', '○', '○', '○', '×'),
('神戸星城高校', '緑ヶ丘', '078-741-1860', '○', '○', '○', '○', '×'),
('南落合小学校', '南落合', '078-792-5244', '○', '○', '○', '○', '○'),
('竜が台小学校', '竜が台', '078-793-1833', '○', '○', '○', '○', '×'),
('竜が台中学校', '竜が台', '078-791-0762', '○', '○', '○', '○', '○'),
('菅の台小学校', '菅の台', '078-791-0233', '△', '○', '○', '○', '○'),
('花谷小学校', '東落合', '078-791-8272', '○', '○', '○', '○', '×'),
('東落合中学校', '東落合', '078-792-5558', '○', '○', '○', '○', '○'),
('西落合小学校', '西落合', '078-792-5556', '○', '○', '○', '○', '○'),
('北須磨文化センター', '中落合', '078-791-0840', '○', '○', '○', '○', '×'),
('西落合中学校', '西落合', '078-791-8444', '○', '○', '○', '○', '○'),
('須磨翔風高校', '西落合', '078-798-4155', '○', '○', '○', '○', '×'),
('若草小学校', '若草町', '078-743-7311', '○', '○', '○', '○', '○'),
('須磨北中学校', '東白川台', '078-741-6465', '○', '○', '○', '○', '○'),
('東落合小学校', '東落合', '078-793-1844', '○', '○', '○', '○', '○'),
('松尾小学校', '北落合', '078-791-8422', '△', '○', '○', '○', '○'),
('神の谷小学校', '神の谷', '078-791-8277', '○', '○', '○', '○', '○'),
('白川小学校', '白川台', '078-792-2619', '○', '○', '○', '○', '○'),
('白川台中学校', '白川台', '078-792-5711', '○', '○', '○', '○', '○');

# テーブル	sumaku_items1の作成
drop table if exists sumaku_items1;
# テーブル	sumaku_items1の作成
create table sumaku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO sumaku_items1(name, town, tunami, fire, petto)
VALUES
('千歳公園', '千歳町', '○', '○', '○'),
('だいち小学校グラウンド', '大池町', '○', '○', '○'),
('須磨海浜公園', '若宮町', '○', '×', '○'),
('須磨離宮公園', '東須磨', '○', '○', '○'),
('須磨浦公園', '一ノ谷町', '×', '○', '○'),
('妙法寺川公園', '戸政町', '○', '○', '○'),
('下中島公園', '中島町', '○', '○', '○'),
('妙法寺川左岸公園', '大池町', '○', '○', '○'),
('鷹取駅北公園', '大池町', '○', '○', '○');

# データベースの選択
USE seisaku;
# テーブルtarumiku_items0の作成
drop table if exists tarumiku_items0;
# テーブルtarumiku_items0の作成
create table tarumiku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into tarumiku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('塩屋小学校', '塩屋町', '078-751-4400', '○', '○', '○', '○', '○'),
('塩屋中学校', '塩屋町', '078-753-2271 ', '○', '○', '○', '○', '○'),
('兵庫県自治研修所', '塩屋町', '078-752-1321', '○', '○', '○', '×', '×'),
('塩屋北小学校', '塩屋北町', '078-752-7575', '○', '○', '○', '○', '×'),
('塩屋台自治会館', '塩屋台', '-', '○', '○', '○', '○', '×'),
('下畑台小学校', '桃山台', '078-752-6780', '○', '○', '○', '○', '○'),
('桃山台中学校', '桃山台', '078-752-1201', '○', '○', '○', '○', '○'),
('下畑公会堂', '下畑町', '-', '○', '○', '○', '○', '×'),
('つつじが丘小学校', 'つつじが丘', '078-709-7751', '○', '○', '○', '○', '○'),
('福田小学校', '乙木', '078-753-3515', '○', '○', '○', '○', '○'),
('東垂水小学校', '王居殿', '078-751-2623', '○', '○', '○', '○', '○'),
('視覚特別支援学校', '城が山', '078-751-3291', '○', '○', '○', '×', '○'),
('乙木小学校', '美山台', '078-752-4205', '○', '○', '○', '○', '○'),
('垂水東中学校', '青山台', '078-751-6139', '○', '○', '○', '○', '○'),
('東垂水公民館', '東垂水', '078-753-5025', '○', '○', '○', '○', '○'),
('名谷小学校', '名谷町', '078-707-2481', '○', '○', '○', '○', '○'),
('福田中学校', '名谷町', '078-708-1670', '△', '○', '○', '○', '○'),
('神戸聴覚特別支援学校', '福田', '078-709-9301', '〇', '〇', '〇', '×', '○'),
('高丸小学校', '大町', '078-707-8877', '○', '○', '○', '○', '○'),
('千鳥が丘小学校', '千鳥が丘', '078-709-1655', '○', '○', '○', '○', '○'),
('垂水小学校', '日向', '078-707-6006', '○', '○', '○', '○', '○'),
('垂水年金会館', '平磯', '078-752-4181', '○', '○', '○', '○', '○'),
('垂水体育館', '平磯', '078-751-0500', '○', '○', '○', '○', '○'),
('霞ヶ丘小学校', '霞ヶ丘', '078-706-0156', '○', '○', '○', '○', '○'),
('歌敷山中学校', '歌敷山', '078-707-8864', '○', '○', '○', '○', '○'),
('東舞子小学校', '舞子台', '078-782-2712', '○', '○', '○', '○', '○'),
('舞子小学校', '西舞子', '078-782-2332', '○', '○', '○', '○', '○'),
('西舞子小学校', '狩口台', '078-781-0004', '○', '○', '○', '○', '○'),
('舞子中学校', '狩口台', '078-781-0001', '△', '○', '○', '○', '○'),
('神陵台小学校', '神陵台', '078-781-3843', '○', '○', '○', '○', '○'),
('神陵台中学校', '神陵台', '078-781-0700', '○', '○', '○', '○', '○'),
('多聞台小学校', '多聞台', '078-782-0375', '○', '○', '○', '○', '○'),
('西脇小学校', '西脇', '078-781-9531', '○', '○', '○', '○', '○'),
('千代が丘小学校', '上高丸', '078-708-8801', '○', '○', '○', '○', '○'),
('垂水中学校', '上高丸', '078-707-6363', '○', '○', '○', '○', '○'),
('本多聞中学校', '本多聞', '078-784-6310', '○', '○', '○', '○', '○'),
('舞多聞小学校', '舞多聞西', '078-787-3700', '○', '○', '○', '○', '○'),
('多聞の丘小学校', '本多聞', '078-784-4477', '○', '○', '○', '○', '○'),
('小束山小学校', '小束山', '078-784-2656', '○', '○', '○', '○', '○'),
('星陵台中学校', '星陵台', '078-709-8810', '○', '○', '○', '○', '○'),
('星陵高校', '星陵台', '078-707-6565', '○', '○', '○', '○', '○'),
('神戸商業高校', '星陵台', '078-707-6464', '○', '○', '○', '○', '○'),
('多聞東小学校', '学が丘', '078-783-5868', '○', '○', '○', '○', '○'),
('多聞東中学校', '学が丘', '078-783-5888', '△', '○', '○', '○', '○'),
('舞子高校', '学が丘', '078-783-5151', '○', '○', '○', '○', '○');

# テーブル	tarumiku_items1の作成
drop table if exists tarumiku_items1;
# テーブル	tarumiku_items1の作成
create table tarumiku_items1(
    name varchar(50) not null,
    town varchar(50) not null,
    tunami varchar(10) not null,
    fire varchar(10) not null,
    petto varchar(10) not null
    );
INSERT INTO tarumiku_items1(name, town, tunami, fire, petto)
VALUES
('塩屋中学校グラウンド', '塩屋町字大谷', '○', '○', '○'),
('青山台東公園', '青山台', '○', '○', '○'),
('平磯芝生広場', '平磯', '×', '○', '○'),
('平磯緑地', '平磯', '×', '○', '○'),
('マリンピア神戸', '海岸通', '×', '○', '○'),
('アジュール舞子', '海岸通', '×', '○', '○'),
('舞子墓園', '舞子陵', '○', '○', '○'),
('舞子中学校グラウンド', '狩口台', '○', '○', '○'),
('西舞子小学校グラウンド', '狩口台', '○', '○', '○'),
('矢元台公園', '狩口台', '○', '○', '○');

# データベースの選択
USE seisaku;
# テーブルnisiku_items0の作成
drop table if exists nisiku_items0;
# テーブルnisiku_items0の作成
create table nisiku_items0(
    name varchar(50) not null,
    town varchar(50) not null,
    telephone varchar(50) not null,
    dosha varchar(10) not null,
    kouzui varchar(10) not null,
    tunami varchar(10) not null,
    Shelter varchar(10) not null,
    petto varchar(10) not null
    );
insert into nisiku_items0 (name, town, telephone, dosha, kouzui, tunami, Shelter, petto)
values
('太山寺小学校', '伊川谷町', '078-974-0007', '○', '○', '－', '○', '○'),
('伊川谷小学校', '北別府', '078-974-0006', '○', '△', '－', '○', '○'),
('長坂小学校', '伊川谷町長坂', '078-974-2333', '○', '○', '－', '○', '○'),
('長坂中学校', '伊川谷町長坂', '078-974-3830', '○', '○', '－', '○', '○'),
('伊川谷高校', '伊川谷町長坂', '078-974-5630', '○', '○', '－', '○', '○'),
('有瀬小学校', '伊川谷町有瀬', '078-974-2709', '○', '○', '－', '○', '○'),
('伊川谷中学校', '伊川谷町上脇', '078-974-0005', '×', '○', '－', '○', '○'),
('小寺小学校', '学園西町', '078-791-2950', '○', '○', '－', '○', '○'),
('兵庫県立大学（神戸商科キャンパス）', '学園西町', '078-794-5245', '○', '○', '－', '○', '○'),
('東町小学校', '学園東町', '078-794-4000', '○', '○', '－', '○', '○'),
('太山寺中学校', '学園東町', '078-791-7090', '○', '○', '－', '○', '○'),
('神戸市外国語大学', '学園東町', '078-794-8121', '×', '○', '－', '○', '○'),
('工業高等専門学校', '学園東町', '078-795-3311', '×', '○', '－', '○', '○'),
('井吹東小学校', '井吹台東町', '078-997-0820', '○', '○', '－', '○', '○'),
('井吹台中学校', '井吹台西町', '078-997-0850', '○', '○', '－', '○', '○'),
('井吹西小学校', '井吹台西町', '078-997-0114', '○', '○', '－', '○', '○'),
('井吹の丘小学校', '井吹台北町', '078-990-5533', '○', '○', '－', '○', '○'),
('春日台小学校', '春日台', '078-961-0251', '○', '○', '－', '○', '○'),
('平野中学校', '春日台', '078-961-0058', '○', '○', '－', '○', '○'),
('西体育館', '春日台', '078-961-1381', '○', '○', '－', '○', '○'),
('美賀多台小学校', '美賀多台', '078-991-7659', '○', '○', '－', '○', '○'),
('平野小学校', '平野町宮前', '078-961-0011', '○', '○', '－', '○', '○'),
('櫨谷小学校', '櫨谷町池谷', '078-991-0004', '○', '○', '－', '○', '○'),
('糀台小学校', '糀台', '078-991-1635', '○', '○', '－', '○', '○'),
('櫨谷中学校', '糀台', '078-991-0026', '○', '○', '－', '○', '○'),
('狩場台小学校', '狩場台', '078-991-3415', '○', '○', '－', '○', '○'),
('竹の台小学校', '竹の台', '078-991-4471', '○', '○', '－', '○', '○'),
('西神中学校', '竹の台', '078-992-2700', '○', '○', '－', '○', '○'),
('樫野台小学校', '樫野台', '078-992-2500', '○', '○', '－', '○', '○'),
('木津小学校', '桜が丘東町', '078-994-0003', '○', '○', '－', '○', '○'),
('桜が丘小学校', '桜が丘中町', '078-994-8010', '○', '○', '－', '○', '○'),
('桜が丘中学校', '桜が丘東町', '078-994-8822', '○', '○', '－', '○', '○'),
('押部谷小学校', '押部谷町福住', '078-994-0002', '○', '○', '－', '○', '○'),
('北山小学校', '北山台', '078-994-8020', '○', '○', '－', '○', '○'),
('押部谷中学校', '押部谷町押部', '078-994-0013', '○', '○', '－', '○', '○'),
('月が丘小学校', '月が丘', '078-995-3171', '○', '○', '－', '○', '○'),
('高和小学校', '押部谷町高和', '078-994-0004', '○', '○', '－', '○', '○'),
('玉津第一小学校', '小山', '078-928-3790', '○', '△', '－', '○', '×'),
('出合小学校', '中野', '078-928-5516', '○', '○', '－', '○', '○'),
('王塚台中学校', '王塚台', '078-928-1277', '○', '○', '－', '○', '○'),
('枝吉小学校', '枝吉', '078-928-0880', '○', '○', '－', '○', '○'),
('高津橋小学校', '玉津町高津橋', '078-917-6501', '○', '○', '－', '○', '○'),
('玉津南公民館', '玉津町上池', '078-914-4300', '○', '〇', '－', '○', '○'),
('玉津中学校', '玉津町今津', '078-918-2266', '○', '○', '－', '○', '○'),
('神出小学校', '神出町田井', '078-965-0006', '○', '○', '－', '○', '○'),
('神出中学校', '神出町東', '078-965-0025', '△', '○', '－', '○', '○'),
('岩岡小学校', '岩岡町古郷', '078-967-0013', '○', '○', '－', '○', '○'),
('岩岡中学校', '岩岡町古郷', '078-967-0016', '○', '○', '－', '○', '○');
